app/views/comments/_comment.html.erb

      <div class="comment_time">
         <%= time_ago_in_words(comment.created_at) %>.
      </div>
---
INSERT INTO "comments" ("movie_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["movie_id", 1], ["user_id", 2], ["content", "qrqử\r\n\r\nsfà\r\n"], ["created_at", 2016-10-26 15:31:04 UTC], ["updated_at", 2016-10-26 15:31:04 UTC]]