app/controllers/admin/customers_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @customers = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_customer
    @customer = User.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_movie
    @movie = Movie.find_by id: params[:id]