app/controllers/admin/genres_controller.rb

UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "Funny"], ["updated_at", 2016-10-24 04:56:12 UTC], ["id", 1]]
---
  def update
    if @genre.update genre_params

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Funny"], ["created_at", 2016-10-20 06:26:56 UTC], ["updated_at", 2016-10-20 06:26:56 UTC]]
---
  def create
    @genre = Genre.new genre_params
    if @genre.save

DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
  def destroy
    if @genre.destroy

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_genre
    @genre = Genre.find_by id: params[:id]