app/controllers/admin/movies_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @movie = Movie.new
    @genres = Genre.all

SELECT "movies".* FROM "movies"
---
  def index
    @search = Movie.search params[:q]

INSERT INTO "movies" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["content", ""], ["created_at", 2016-10-20 09:24:46 UTC], ["updated_at", 2016-10-20 09:24:46 UTC]]
---
  def create
    @movie = Movie.new movie_params
    if @movie.save

SELECT "genres".* FROM "genres"
---
  def edit
    @genres = Genre.all

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 7]]
---
  def destroy
    if @movie.destroy

UPDATE "movies" SET "image" = ?, "content" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image", "saitama.png"], ["content", "<b>One punch man is very famous anime in the world</b><br><br>"], ["updated_at", 2016-10-24 04:58:59 UTC], ["id", 1]]
---
  def update
    if @movie.update movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def find_movie
    @movie = Movie.find_by id: params[:id]