app/views/movies/show.html.erb

                        <div class="ndmv-celeb-detail">
                           <% @movie.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "movie_genres" ON "genres"."id" = "movie_genres"."genre_id" WHERE "movie_genres"."movie_id" = ?  [["movie_id", 1]]

           <div id="comments_<%= @movie.id %>">
             <% if @movie.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."movie_id" = ? LIMIT ?  [["movie_id", 1], ["LIMIT", 1]]