app/views/admin/movies/index.html.erb

    f, :condition %></div>
  <div class="actions"><%= f.submit t("movie.search"),
    class: "btn btn-primary" %></div>
---
SELECT "movies".* FROM "movies"