app/views/admin/movies/show.html.erb

    <h3>
      <% @movie.movie_genres.each do |movie_genre|  %>
---
SELECT "movie_genres".* FROM "movie_genres" WHERE "movie_genres"."movie_id" = ?  [["movie_id", 7]]