app/controllers/comments_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("movie_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["movie_id", 1], ["user_id", 2], ["content", "qrqử\r\n\r\nsfà\r\n"], ["created_at", 2016-10-26 15:31:04 UTC], ["updated_at", 2016-10-26 15:31:04 UTC]]
---
  def create
    @comment = current_user.comments.build comment_params
    @movie = Movie.find_by id: @comment.movie_id
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
  def destroy
    @comment = current_user.comments.find_by id: params[:id]
    @movie = @comment.movie
    @comment.destroy