app/controllers/movies_controller.rb

  def show
    @rate = Rate.new
    @votes = Rate.votes
    @genre = @movie.genres.first
---
SELECT "genres".* FROM "genres" INNER JOIN "movie_genres" ON "genres"."id" = "movie_genres"."genre_id" WHERE "movie_genres"."movie_id" = ?  [["movie_id", 1]]

  def find_movie
    @movie = Movie.find_by id: params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]