app/controllers/static_pages_controller.rb

  def home
    @movie = Movie.first
---
SELECT  "movies".* FROM "movies" ORDER BY "movies"."id" ASC LIMIT ?  [["LIMIT", 1]]