app/controllers/users_controller.rb

  def find_user
    @user = User.find_by id: params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]